Revit.References.RayBounce.ByOriginDirection(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Int32,Revit.Elements.Views.View3D)
Returns positions and elements hit by ray bounce from the specified origin point and direction
origin:
direction:
maxBounces:
view:
Returns:

Revit.References.RayBounce.FindClosestReference(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.ReferenceWithContext})
Find the first intersection with a face
references:
Returns: